2023/Fichiers_tex/rapport-2023-10-06.tex
% Created 2024-06-16 Sun 00:13
% Intended LaTeX compiler: pdflatex
ocumentclass[10pt]{article}% =================================BASE====================================%
\documentclass[10pt]{report}
\usepackage[left=2cm,right=2cm,top=2cm,bottom=2cm]{geometry} % Marges
\usepackage[T1]{fontenc} % Nécessaire avec FrenchBabel
\usepackage[utf8]{inputenc} % Important pour symboles Francophones, é,à,etc
\usepackage{csquotes} % Recommandé par PDFLatex lors de la compilation. 


% Calligraphie
%\usepackage{lmodern} % Ça, ça set latin modern
%\usepackage{mathrsfs} %Permet la command \mathscr (Lettres attachées genre) \mathscr(B)

% Calligraphie
%\usepackage{pxfonts} % Met le texte ET les maths en Palatino + donne accès à des symboles math
\usepackage{palatino} % Cette commande met seulement le texte en police palatino
\usepackage{lmodern} % Pour les maths?
% Use lmodern for sans-serif
\usepackage{mathrsfs} % Permet la command \mathscr (Lettres attachées genre) \mathscr(B)





% Bibliographie
%\usepackage[backend=bibtex,style=phys,sorting=ynt]{biblatex}
\usepackage[backend=biber,sorting=ynt,style=ieee]{biblatex}
\addbibresource{/home/charlesedouard/Desktop/Travail/Documentation/master-bibliography.bib}



\usepackage{amsmath, amssymb, amsthm} % Symb. math. (Mathmode+Textmode) + Beaux théorèmes.
\usepackage{mathtools,cancel,xfrac} % Utilisation de boîtes \boxed{} + \cancelto{}{}, xfrac
\usepackage{graphicx, wrapfig} % Géstion des figures.
\usepackage{hyperref} % Permettre l'utilisation d'hyperliens.
\usepackage{color} % Permettre l'utilisation des couleurs.
\usepackage{colortbl} % Color tables
\usepackage[dvipsnames]{xcolor} % Couleurs avancées.
\usepackage{titling} % Donne accès à \theauthor, \thetitle, \thedate

% Physique
\usepackage{physics} % Meilleur package pour physicien. 


% Style
\usepackage{lipsum} % For fun
\usepackage{tikz} % Realisation de figures TIKZ.
\usepackage{empheq} % Boite autour de MULTIPLE équations
\usepackage{bbding}

% Français
\usepackage[french]{babel} % Environnements en Français.
% ==============================BASE-(END)=================================%



% ================================SETTINGS=================================%
% Pas d'indentation en début de paragraphe :
\setlength\parindent{0pt}
\setlength{\parskip}{0.15cm}

% Tableaux/tabular
% Espace vertical dans les tabular/tableaux
\renewcommand{\arraystretch}{1.2}
% Couleur des tableaux/tabular
\rowcolors{2}{violet!5}{}

% Couleurs de hyperliens :
\definecolor{mypink}{RGB}{147, 0, 255}
\hypersetup{colorlinks, 
             filecolor=mypink,
             urlcolor=mypink, 
             citecolor=mypink, 
             linkcolor=mypink, 
             anchorcolor=mypink}


\usepackage{titling} % Donne accès à \theauthor, \thetitle, \thedate

% Physique
\usepackage{physics} % Meilleur package pour physicien. 


% Style
\usepackage{lipsum} % For fun
\usepackage{tikz} % Realisation de figures TIKZ.
\usepackage{empheq} % Boite autour de MULTIPLE équations

% Français
\usepackage[french]{babel} % Environnements en Français.
% ==============================BASE-(END)=================================%





% ================================SETTINGS=================================%
% Pas d'indentation en début de paragraphe :
\setlength\parindent{0pt}
\setlength{\parskip}{0.15cm}

% Tableaux/tabular
% Espace vertical dans les tabular/tableaux
\renewcommand{\arraystretch}{1.2}
% Couleur des tableaux/tabular
\rowcolors{2}{violet!5}{}

% Couleurs de hyperliens :
\definecolor{mypink}{RGB}{147, 0, 255}
\hypersetup{colorlinks, 
             filecolor=mypink,
             urlcolor=mypink, 
             citecolor=mypink, 
             linkcolor=mypink, 
             anchorcolor=mypink}


% Numéros d'équations suivent les sections :
\numberwithin{equation}{section} 

% Les « captions » sont en italique et largeur limitée
\usepackage[textfont = it]{caption} 
\captionsetup[wrapfigure]{margin=0.5cm}

% Retirer l'écriture en gras dans la table des matières
\usepackage{tocloft}
\renewcommand{\cftsecfont}{\normalfont}
\renewcommand{\cftsecpagefont}{\normalfont}

% Change bullet style
\usepackage{pifont}
\usepackage{enumitem}
%\setlist[itemize,1]{label=\ding{224}}
\setlist[itemize,1]{label=\ding{239}}
\renewcommand{\boxtimes}{\blacksquare}
% ================================SETTINGS=================================%



% ==============================NEWCOMMANDS================================%

% Vecteurs de base :
\newcommand{\nvf}{\vb{\hat{n}}}
\newcommand{\ivf}{\vb{\hat{i}}}
\newcommand{\jvf}{\vb{\hat{j}}}
\newcommand{\kvf}{\vb{\hat{k}}}
\newcommand{\uu}{\vb{u}}
\newcommand{\vv}{\vb{v}}
\newcommand{\ust}{\vb{u}_{\ast}}

% Physics empty spaces 
\newcommand{\typical}{\vphantom{A}}
\newcommand{\tall}{\vphantom{A^{x^x}_p}}
\newcommand{\grande}{\vphantom{\frac{1}{xx}}}
\newcommand{\venti}{\vphantom{\sum_x^x}}
\newcommand{\pt}{\hspace{1pt}} % One horizontal pt space

% Moyenne numérique entre deux points de grilles. 
\newcommand{\xmean}[1]{\overline{#1}^x}
\newcommand{\ymean}[1]{\overline{#1}^y}
\newcommand{\zmean}[1]{\overline{#1}^z}
\newcommand{\xymean}[1]{\overline{#1}^{xy}}

% Tilde over psi
\newcommand{\tpsi}{\tilde{\psi}}
\newcommand{\tphi}{\tilde{\phi}}

% Nota Bene env : (\ding{89})
%\newcommand{\nb}{$\boxed{\text{\footnotesize\EightStarConvex}\pt \mathfrak{N. B.}}$\hspace{4pt}}
\newcommand{\nb}{\underline{{\footnotesize\EightStarConvex}\pt $\mathfrak{N.B.}$\vphantom{p}}\hspace{3pt}}


% Define the nota bene environment
\usepackage{tcolorbox}
\newtcolorbox{notabene}{
     colback=blue!5,
     colframe=black,
     boxrule=0.5pt,
     arc=2pt,
     left=5pt,
     right=5pt,
     top=5pt,
     bottom=5pt,
}


\newcommand{\cmark}{\ding{52}}
\newcommand{\xmark}{\ding{55}}
% ==============================NEWCOMMANDS================================%



% ==============================PAGE-TITRE=================================%
% Titlepage 
\newcommand{\mytitlepage}{
\begin{titlepage}
\begin{center}
{\Huge Contrat Été 2023 \par}
\vspace{2cm}
{\Huge \MakeUppercase{\thetitle} \par}
\vspace{2cm}
RÉALISÉ DANS LE CADRE\\ D'UN PROJET POUR \par
\vspace{2cm}
{\Huge ISMER--UQAR \par}
\vspace{2cm}
{\thedate}
\end{center}
\vfill
Rédaction \\
{\theauthor}\\
\url{charles-edouard.lizotte@uqar.ca}\\
ISMER-UQAR\\
Police d'écriture : \textbf{CMU Serif Roman}
\end{titlepage}
}
% ==============================PAGE-TITRE=================================%



% =================================ENTÊTE==================================%
\usepackage{fancyhdr}
\pagestyle{fancy}
\setlength{\headheight}{13pt}
\renewcommand{\headrulewidth}{0.025pt} % Ligne horizontale en haut

\fancyhead[R]{\textit{\thetitle}}
\fancyhead[L]{\ \thepage}
\fancyfoot[R]{\textit{\theauthor}}
\fancyfoot[L]{}
\fancyfoot[C]{} 
% =================================ENTÊTE==================================%
\author{Charles-Édouard Lizotte}
\date{06/10/2023}
\title{Carnet de bord, Université McGill}
\hypersetup{
 pdfauthor={Charles-Édouard Lizotte},
 pdftitle={Carnet de bord, Université McGill},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.1 (Org mode 9.6.7)}, 
 pdflang={French}}
\begin{document}

\mytitlepage
\tableofcontents\newpage

\section{{\bfseries\sffamily DONE} Le problème des ondes de Kelvin au bord -- \textit{<2023-10-03 Tue>}}
\label{sec:org95422f6}
Depuis quelques temps, toutes les simulations numériques non-couplées plantaient.
Lorsque nous analysions les \emph{output}, il était évident que quelque chose se passait aux bords.
L'épaisseur de la couche de surface atteingnait son minimum au côtes nord et sud, come si une onde de Kelvin beaucoup trop forte s'y était développée.

\subsection{Partial slip condition}
\label{sec:org6e11471}
David eu la brillante idée de vouloir « ralentir » l'onde -- et donc diminuer son amplitude -- en changeant sa vitesse aux frontières.
Pour se faire, nous avions choisi de modifier la \emph{free slip condition} pour quelque chose qui retirerait du momentum aux frontières, donc une \emph{partial slip condition}.
Aux frontières, la dérivée serait plutôt exprimée selon
\begin{equation}
   \eval{\qty(\pdv{v}{x} + \alpha v)\pt}_{x=0} = 0,
\end{equation}
ce qui se traduit en différence finie par
\begin{equation}
   \qty(\frac{v(1) - v(0)}{\Delta x}) + \alpha\pt\qty( \frac{v(1)+v(0)}{2}) = 0.
\end{equation}

Et puis le paramètre \(\alpha\) devrait représenter l'inverse d'une longueur charactéristique \(L_c\), de sorte que
\begin{align}
   && \alpha = \frac{1}{L_c}, && \text{tel que} && L_c \sim 5\ \text{km}. && 
\end{align}
Mais malgré tout, ça n'a pas sembler fonctionner.
En effet, avec le temps, le courant et sa dérivée se stabilisent et l'effet devient quasiment similaire à un \emph{free slip} selon David.
De plus, notre longueur caractéristique \(L_c\) ne peut pas être si grande que ça, ce qui fait en sorte que quelques points plus loin que la frontière et on est revenu à une condition quasi \emph{free slip}.
Donc, malgré que la \emph{switch} est présente dans le fichier de paramètres, nous avons abandonné ce chemin.

\subsection{Changer l'hyperviscosité par une viscosité -- \textit{<2023-10-04 Wed>}}
\label{sec:org35d08d2}
David soupçonnait qu'il y avait un problème relié à l'hyperviscosité dans le modèle.
Il aurait été possible que la manière qu'on avait implémenté l'hyperviscosité ne fonctionne pas bien avec les bords -- étant donné que ça met en jeu un Laplacien double, etc. 
C'est pourquoi David m'a proposé de la changer pour une viscosité qui dépend du Laplacien directement.
On aurait même pu mettre les deux, au final.
La viscosité peut en fait être exprimée mathématiquement par
\begin{equation}
   \text{Viscosité} = Ah_2 \laplacian{u}  - Ah_4 \gradient^4 u.
\end{equation}
Bien que nous ayons implémenté une viscosité au lieu d'une hyperviscosité, le résultat était toujours le même.
Les couches du modèle atteingnaient des épaisseurs nulles après quelques pas de temps aux frontières nord et sud.

\subsection{Changer le profil de vent -- \textit{<2023-10-04 Wed>}}
\label{sec:org6c2edf0}
Après avoir fait pas mal de recherche sur les ondes de Kelvin dans le \autocite{vallis_2006}, David est arrivé à la conclusion que ce n'étaient pas des ondes de Kelvin, mais plutôt de l'\emph{upwelling} induit par le courant de bord.
Ce courant était trop fort à cause du vent, donc on est passé d'un vent
\begin{equation}
   \tau = -\tau_0 \cdot \cos(\frac{2\pi y}{L_y}),
\end{equation}
à 
\begin{equation}
   \tau = \tau_0\cdot\qty(1-\cos(\frac{2\pi y}{L_y})).
\end{equation}
On a aussi diminué la valeur de \(\tau_0\) de moitié et tout fonctionne mieux.
Le modèle produit maintenant des instabilités barocliniques sans problème.

\section{{\bfseries\sffamily DONE} Compute Canada -- \textit{<2023-10-05 Thu>}}
\label{sec:orgbf49213}
\subsection{Introduction}
\label{sec:org66704dd}
Pour se connecter,
\begin{verbatim}
  ssh -Y celiz2@beluga.computecanada.ca
\end{verbatim}
Le mot de passe est laissé à la discrétion du lecteur de ce rapport.
En résumé, nous travaillons sur la grappe de calcul de l'ETS, soit Beluga en l'honneur de la baleine qui est en train de crever dans le Saint-Laurent.

\subsection{Importation des modules sur Compute Canada}
\label{sec:org59f0e5d}
Pour faire fonctionner nos modèles, on a besoin d'une couple de modules.
Au même titre que sur la grappe de calcul Mingan, il est toujours possible de voir les modules listés à l'aide de la commande
\begin{verbatim}
  module list
\end{verbatim}
Et normalement, il est possible de voir les modules disponibles à l'aide de la commande
\begin{verbatim}
  module avail
\end{verbatim}
Par contre, il y a tellement de modules qu'on est fortement encouragé d'utiliser le modteur de recherche \emph{spider} pour voir si un module existe.
Par exemple,
\begin{verbatim}
  module spider <module name>
\end{verbatim}

Pour le modèle \emph{shallow water}, on a besoin de deux modules, soient
\begin{verbatim}
  # Shallow watewr model stull
  module load openblas
  module load flexiblas
\end{verbatim}
qui nous permettent d'avoir \emph{BLAS} et \emph{LAPACK}.
Pour ce qui est de \emph{fishpack}, tout s'est installé sans problème et les librairies sont dans le répertoire local.
Tandis que pour Wavewatch III, il faut absolument ajouter ces commandes à notre \emph{.bashrc}, soient 
\begin{verbatim}
  # Wavewatch III stuff                                                                       
  module load netcdf-fortran
  export WWATCH3_NETCDF=NC4
  export NETCDF_CONFIG=/cvmfs/soft.computecanada.ca/easybuild/software/2020/avx512/Compiler/intel2020/netcdf/4.9.0/bin/\
  nc-config
  PATH=$PATH:$HOME/projects/def-lpnadeau/celiz2/wavewatch3/bin
  PATH=$PATH:$HOME/projects/def-lpnadeau/celiz2/wavewatch3/exe
  export PATH
\end{verbatim}


\subsection{Script bash de type SLURM -- \textit{<2023-10-10 Tue>}}
\label{sec:org9dd719a}

Pour faire fonctionner les module MPI sur compute Canada, il faut utiliser \emph{srun}, mais la commande \emph{mpirun} fonctionne aussi.\bigskip

\subsection{Compilation des modèles numériques en MPI -- \textit{<2023-10-10 Tue>}}
\label{sec:orgb299133}
Un résumé rapide du travail effectué pour que ça \emph{marche} entre vendredi et mardi : \bigskip
\begin{enumerate}
\item Le modèle \emph{shallow water} doit \textbf{absolument} être compilé avec \emph{gfortran}, \emph{fishpack} n'a malheureusement pas été programé pour fonctionner avec \emph{ifort};\bigskip
\item Il semble que les deux modèles doivent \textbf{impérativement} être compilés avec le même compilateur pour que MPI fonctionne.
Je n'avais initialement pas ce problème sur mon ordinateur personnel, mais il semble que ça soit nécessaire sur Béluga.
On pourrait peut-être trouver un moyen définissant des variables globales de MPI, mais je préfère ne pas m'embarquer là-dedans. Ça serait une perte de temps monumentale.\bigskip
\item La sous-routine \emph{ww3 prnc} du modèle Wavewatch (soit la routine qui transforme les fichiers NetCDF en input pour Wavewatch) ne peut pas être compilée avec \emph{gfortran}. Pour vrai, j'ai tout essayer.
C'est comme si -- malgré l'importation des modules nécessaires (netcdf, netcdf-fortran, netcdf-mpi-fortran, etc) -- la fonction \textbf{USE MPI} dans la sous-routine \emph{ww3 prnc} est incapable de compiler.\bigskip

Comme solution, je compile donc toutes les sous-routines qui ne sont pas le \emph{shel} avec \emph{ifort} et je compile le \emph{shel} en MPI avec \emph{gfortran}.
C'est malheureusement le seul moyen que j'ai trouvé.\bigskip
\end{enumerate}

Dans le meilleur des mondes, j'aurais aimé que tout se compile soit avec \emph{gfortran} ou avec \emph{ifort}, mais il semble que ça doit en être autrement.
Je voulais mettre ça ici, parce que ça m'a pris beaucoup de temps pour \emph{fuck around and find out} tout ça.


\section{{\bfseries\sffamily DONE} Nouveau schéma pour l'introduction de la dérive de Stokes dans les équations du mouvement -- \textit{<2023-10-06 Fri>}}
\label{sec:orgab49a9f}
Initialement, les équations du mouvement d'un système Boussinesq sont exprimées selon l'expression
\begin{equation}
\label{eq:orgc5f0991}
   \pdv{\uu}{t} = \qty(f+\zeta)\pt \kvf\times\uu = -\gradient{B} + \boldsymbol{D} + \frac{\boldsymbol{\tau_a}}{\rho_o H},
\end{equation}
où la fonction de Bernouilli (\(B\)) est exprimée par \(B = p/\rho_o + \uu^2/2\).\bigskip

Dans leur résumé, \Textcite{suzuki2016understanding}  définissent la dérive de Stokes \(\uu_S\) comme une contribution lagrangienne à notre écoulement, de sorte qu'on peut décrire ce courant lagrangien \(\uu_L\) par
\begin{equation}
   \uu_L = \uu + \uu_S.
\end{equation}
En somme, 
\begin{itemize}
\item Ce courant lagrangien \(\uu_L\) se substitue dans les termes d'advection, de la même manière qu'un référentiel en mouvement ;
\item Les termes de Stokes-Coriolis, Craik-Leibovic et la nouvelle fonction de Bernouilli découlent donc directement cette au référentiel en mouvement. \bigskip
\end{itemize}

Lorsqu'on ajoute cette contribution lagrangienne à notre courant, l'expression \ref{eq:orgc5f0991} devient plutôt
\begin{equation}
   \pdv{\uu}{t} = \qty(f+\zeta)\pt \kvf\ \times\underbrace{\grande\qty(\uu + \uu_S)}_{\substack{\text{Courant} \\ \text{Lagrangien}}} = \underbrace{\grande-\gradient{B_S}}_\text{B.-Stokes} + \ \boldsymbol{D} \underbrace{+ \frac{\tau_o}{\rho_o H}.}_{\substack{\text{Contr. des} \\ \text{Vagues}}}
\end{equation}
où la nouvelle fonction de Bernouilli qui tient compte de la dérive de Stokes est donnée par
\begin{align}
   B_S = B + \uu\cdot\uu_S + \uu_S^2/2.
\end{align}

\printbibliography
\end{document}